app/controllers/finances_controller.rb

  def show
    @finance = Finance.find(params[:id])
---
SELECT "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @finance = Finance.new(user_params)
    if @finance.save
---
INSERT INTO "finances" ("amount", "created_at", "date", "description", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)